tests/performance/checkin-heavy.yml
config:
  target: "{{ $processEnvironment.CHECKIN_TARGET || 'http://localhost:3003' }}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    - duration: 30
      arrivalRate: 100
      name: "Spike test"
    - duration: 60
      arrivalRate: 100
      rampTo: 20
      name: "Cool-down"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./processors/checkin-real-enhanced.js"
  plugins:
    expect: {}
  variables:
    studentId: ""
    roomId: ""
    identificationMethod: "MATRICULA"
    identificationValue: ""

scenarios:
  - name: "Check-in Heavy Load"
    weight: 100
    flow:
      - function: "generateCheckinPayload"
      - post:
          url: "/api/v1/checkin"
          json:
            studentId: "{{ studentId }}"
            roomId: "{{ roomId }}"
            identificationMethod: "{{ identificationMethod }}"
            identificationValue: "{{ identificationValue }}"
          capture:
            - json: "$.checkInId"
              as: "checkInId"
          expect:
            - statusCode: [201, 400, 409]
            - contentType: json
            - hasProperty: checkInId
          afterResponse: "validateCheckinResponse"
      - think: 1