tests/performance/checkin-quick.yml
config:
  target: "{{ $processEnvironment.CHECKIN_TARGET || 'http://localhost:3003' }}"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Quick test"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./processors/checkin-real.js"
  plugins:
    expect: {}
  variables:
    studentId: ""
    roomId: ""
    identificationMethod: "MATRICULA"
    identificationValue: ""

scenarios:
  - name: "Quick Check-in Test"
    weight: 100
    flow:
      - function: "generateCheckinPayload"
      - post:
          url: "/api/v1/checkin"
          json:
            studentId: "{{ studentId }}"
            roomId: "{{ roomId }}"
            identificationMethod: "{{ identificationMethod }}"
            identificationValue: "{{ identificationValue }}"
          capture:
            - json: "$.checkInId"
              as: "checkInId"
          expect:
            - statusCode: [201, 400, 409]
            - contentType: json
          afterResponse: "validateCheckinResponse"